# CannotKeepVariabilityOfRebarInGroup Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..CannotKeepVariabilityOfRebarInGroup Property
BuiltInFailures..::..RebarFailures Class See Also
---
Modifications to the rebar set might cause it to revert to a uniform distribution. This can occur for layout changes as well as modifications to the geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotKeepVariabilityOfRebarInGroup { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotKeepVariabilityOfRebarInGroup As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotKeepVariabilityOfRebarInGroup {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace